Revit 2027 API
ParameterTypeId.RbsSizeLock Property
 "Size Lock"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsSizeLock { get; }
Public Shared ReadOnly Property RbsSizeLock As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsSizeLock {
	ForgeTypeId^ get ();
}
static member RbsSizeLock : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace